## Importing the required data

- upload job vacancies xlsx table to 'data'

In [74]:
#setup data folder (it probably already exists)
!mkdir data

mkdir: cannot create directory ‘data’: File exists

## Converting xlsx file to pandas dataframe

- install openpyxl, import load_workbook and pandas
- load xlsx workbook --> access required sheet
- convert to dataframe with .values

In [75]:
#to open xlsx files
!pip install openpyxl

Requirement already satisfied: openpyxl in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (2.5.8)
Requirement already satisfied: jdcal in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from openpyxl) (1.4)
Requirement already satisfied: et-xmlfile in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from openpyxl) (1.0.1)

In [76]:
import pandas as pd

In [77]:
import numpy as np

In [78]:
from openpyxl import load_workbook
wb1 = load_workbook('./data/ESS_2015_England_Data_Tables__LEA_with_standard_breaks_v05.xlsx')

In [79]:
wb1.sheetnames

['Contents',
 '1',
 '2',
 '3',
 'T7',
 '5',
 '6',
 '7',
 '8',
 '9',
 '10',
 'T41',
 '13',
 'T43',
 'T44',
 'T45',
 '17',
 '18',
 '19',
 '20',
 'T54',
 '23',
 'T56',
 '25',
 '26',
 'T63',
 '29',
 '42',
 'T68A',
 '43',
 '44',
 '45',
 '46',
 'T74',
 '48',
 '49',
 '62',
 '63',
 '64',
 '65',
 '66',
 '67',
 '68',
 '69',
 '70',
 '71',
 '72',
 '73',
 '74',
 '75',
 '76',
 '77',
 '78',
 '79',
 '80',
 '81',
 '82',
 '83',
 '84',
 '85',
 '86',
 '87',
 '88',
 'T133X',
 'T111A',
 '92',
 '93',
 '97',
 '98',
 '99',
 '100',
 '101',
 '103',
 '105',
 '106',
 '107',
 '108',
 '109',
 '110',
 '111',
 '112',
 '113',
 '114',
 '115',
 '116',
 '117',
 '118',
 '119']

In [80]:
ws1 = wb1["T43"]

In [81]:
jobvac = pd.DataFrame(ws1.values)
jobvac.tail()

,0,1,2,3,4,5,6,7,8,9,...,144,145,146,147,148,149,150,151,152,153
13,Total number of hard-to-fill vacancies,262337,6588,2162,710,589,1207,6009,928,1615,...,4533,4035,1089,6362,4967,2649,10254,3756,5534,13
14,None,0.011,0.017,0.007,0.01,0.007,0.01,0.031,0.008,0.012,...,0.013,0.013,0.011,0.019,0.023,0.009,0.02,0.015,0.016,0.016
15,Total number of skills shortage vacancies- pro...,180159,3417,1883,540,523,824,5919,766,1242,...,1872,2809,616,3682,3479,1823,6495,2222,3335,13
16,None,0.008,0.009,0.006,0.008,0.006,0.007,0.031,0.006,0.009,...,0.005,0.009,0.006,0.011,0.016,0.006,0.013,0.009,0.01,0.016
17,Tables produced by IFF,None,None,None,None,None,None,None,None,None,...,None,None,None,None,None,None,None,None,None,None

## Clearing dataframe

- drop first few and last rows
- drop 'Unweighted row', 'Total', 'None' rows
- slice table at coloumn at 'Waltham Forest' and 'Birmingham' and drop latter part
- make coloumn 0 and row 8 axes labels

In [82]:
jobvac

jobvac.drop(0, axis=0, inplace=True)
jobvac.drop(1, axis=0, inplace=True)
jobvac.drop(2, axis=0, inplace=True)
jobvac.drop(3, axis=0, inplace=True)
jobvac.drop(4, axis=0, inplace=True)
jobvac.drop(5, axis=0, inplace=True)
jobvac.drop(6, axis=0, inplace=True)
jobvac.drop(7, axis=0, inplace=True)
jobvac.drop(9, axis=0, inplace=True)
jobvac.drop(10, axis=0, inplace=True)
jobvac.drop(12, axis=0, inplace=True)
jobvac.drop(14, axis=0, inplace=True)
jobvac.drop(16, axis=0, inplace=True)
jobvac.drop(17, axis=0, inplace=True)

jobvac.head()

,0,1,2,3,4,5,6,7,8,9,...,144,145,146,147,148,149,150,151,152,153
8,None,Total,City of London,Camden,Greenwich,Hackney,Hammersmith and Fulham,Islington,Kensington and Chelsea,Lambeth,...,Norfolk,Northamptonshire,Northumberland,Oxfordshire,Somerset,Suffolk,Surrey,Warwickshire,West Sussex,Isles of Scilly
11,Total number of vacancies,797440,18543,12346,2155,2844,5802,17906,5062,4974,...,10367,9916,2630,13814,8919,9527,23592,10018,15126,19
13,Total number of hard-to-fill vacancies,262337,6588,2162,710,589,1207,6009,928,1615,...,4533,4035,1089,6362,4967,2649,10254,3756,5534,13
15,Total number of skills shortage vacancies- pro...,180159,3417,1883,540,523,824,5919,766,1242,...,1872,2809,616,3682,3479,1823,6495,2222,3335,13

In [83]:
jobvac[0].loc[8]="Borough"
jobvac.head()

,0,1,2,3,4,5,6,7,8,9,...,144,145,146,147,148,149,150,151,152,153
8,Borough,Total,City of London,Camden,Greenwich,Hackney,Hammersmith and Fulham,Islington,Kensington and Chelsea,Lambeth,...,Norfolk,Northamptonshire,Northumberland,Oxfordshire,Somerset,Suffolk,Surrey,Warwickshire,West Sussex,Isles of Scilly
11,Total number of vacancies,797440,18543,12346,2155,2844,5802,17906,5062,4974,...,10367,9916,2630,13814,8919,9527,23592,10018,15126,19
13,Total number of hard-to-fill vacancies,262337,6588,2162,710,589,1207,6009,928,1615,...,4533,4035,1089,6362,4967,2649,10254,3756,5534,13
15,Total number of skills shortage vacancies- pro...,180159,3417,1883,540,523,824,5919,766,1242,...,1872,2809,616,3682,3479,1823,6495,2222,3335,13

In [84]:
#reducing frame to only London Boroughs
jvLondon = jobvac.iloc[:, :35]
jvUK = jobvac.iloc[:, 35:]

jvLondon.head()

,0,1,2,3,4,5,6,7,8,9,...,25,26,27,28,29,30,31,32,33,34
8,Borough,Total,City of London,Camden,Greenwich,Hackney,Hammersmith and Fulham,Islington,Kensington and Chelsea,Lambeth,...,Havering,Hillingdon,Hounslow,Kingston upon Thames,Merton,Newham,Redbridge,Richmond upon Thames,Sutton,Waltham Forest
11,Total number of vacancies,797440,18543,12346,2155,2844,5802,17906,5062,4974,...,2621,8359,6429,2033,3058,3185,3495,2998,2790,2216
13,Total number of hard-to-fill vacancies,262337,6588,2162,710,589,1207,6009,928,1615,...,637,1715,1389,727,751,598,1309,802,705,1052
15,Total number of skills shortage vacancies- pro...,180159,3417,1883,540,523,824,5919,766,1242,...,474,1323,1003,304,480,382,1065,432,503,827

In [85]:
jvLondon = jvLondon.T

jvLondon.head()

,8,11,13,15
0,Borough,Total number of vacancies,Total number of hard-to-fill vacancies,Total number of skills shortage vacancies- pro...
1,Total,797440,262337,180159
2,City of London,18543,6588,3417
3,Camden,12346,2162,1883
4,Greenwich,2155,710,540

In [86]:
jvLondon[8].loc[0]="Borough"
jvLondon.head()

,8,11,13,15
0,Borough,Total number of vacancies,Total number of hard-to-fill vacancies,Total number of skills shortage vacancies- pro...
1,Total,797440,262337,180159
2,City of London,18543,6588,3417
3,Camden,12346,2162,1883
4,Greenwich,2155,710,540

In [54]:
jvLondon.set_index(8, inplace=True)

jvLondon.head()

,11,13,15
8,,,
Borough,Total number of vacancies,Total number of hard-to-fill vacancies,Total number of skills shortage vacancies- pro...
Total,797440,262337,180159
City of London,18543,6588,3417
Camden,12346,2162,1883
Greenwich,2155,710,540

In [88]:
jvLondon.columns = jvLondon.loc[0]

jvLondon.head()

,Borough,Total number of vacancies,Total number of hard-to-fill vacancies,Total number of skills shortage vacancies- prompted or unprompted
0,Borough,Total number of vacancies,Total number of hard-to-fill vacancies,Total number of skills shortage vacancies- pro...
1,Total,797440,262337,180159
2,City of London,18543,6588,3417
3,Camden,12346,2162,1883
4,Greenwich,2155,710,540

In [89]:
jvLondon.drop(0, axis=0, inplace=True)
jvLondon.head()

,Borough,Total number of vacancies,Total number of hard-to-fill vacancies,Total number of skills shortage vacancies- prompted or unprompted
1,Total,797440,262337,180159
2,City of London,18543,6588,3417
3,Camden,12346,2162,1883
4,Greenwich,2155,710,540
5,Hackney,2844,589,523

In [90]:
jvLondon.rename(columns={'Total number of vacancies':'vacancies'}, inplace=True)
jvLondon.rename(columns={'Total number of hard-to-fill vacancies':'hard-to-fill_vacancies'}, inplace=True)
jvLondon.rename(columns={'Total number of skills shortage vacancies- prompted or unprompted':'skills-shortage_vacancies'}, inplace=True)

jvLondon.head()

0         Borough vacancies hard-to-fill_vacancies skills-shortage_vacancies
1           Total    797440                 262337                    180159
2  City of London     18543                   6588                      3417
3          Camden     12346                   2162                      1883
4       Greenwich      2155                    710                       540
5         Hackney      2844                    589                       523

## Merging on dataframe
- load 'borough-unemployment-and-business-data.csv
- reduce to only 2015
- delete year if necessary
- merge datasets on "area" (coloumn labels) and "Row1" (row labels)
- save file

In [67]:
df1 = pd.read_csv('./data/processed_borough-unemployment-and-business-data.csv')

df1.head()

,year,area,code,active_enterprises,births,birth_rate,deaths,death_rate,number_of_jobs,job_density,unemployment_rate
0,2004,Barking and Dagenham,E09000002,3120,480,15.4,410,13.1,53000,0.51,8.3
1,2004,Barnet,E09000003,19655,2435,12.4,3015,15.3,135000,0.63,6.3
2,2004,Bexley,E09000004,6450,940,14.6,800,12.4,85000,0.61,4.1
3,2004,Brent,E09000005,11295,1800,15.9,1745,15.4,119000,0.65,9.1
4,2004,Bromley,E09000006,11655,1590,13.6,1375,11.8,126000,0.67,4.7

In [68]:
df2015 = df1[df1['year']==2015]

df2015.head()

,year,area,code,active_enterprises,births,birth_rate,deaths,death_rate,number_of_jobs,job_density,unemployment_rate
484,2015,Barking and Dagenham,E09000002,6560,1665,25.4,765,11.7,62000,0.48,9.7
485,2015,Barnet,E09000003,26190,4460,17.0,3410,13.0,168000,0.68,5.8
486,2015,Bexley,E09000004,9075,1605,17.7,945,10.4,86000,0.57,6.0
487,2015,Brent,E09000005,15745,2895,18.4,1800,11.4,136000,0.62,7.1
488,2015,Bromley,E09000006,15695,2340,14.9,1620,10.3,124000,0.61,4.9

In [91]:
df2015_joined = df2015.merge(jvLondon, left_on='area', right_on='Borough', how='left')

df2015_joined.head()

,year,area,code,active_enterprises,births,birth_rate,deaths,death_rate,number_of_jobs,job_density,unemployment_rate,Borough,vacancies,hard-to-fill_vacancies,skills-shortage_vacancies
0,2015,Barking and Dagenham,E09000002,6560,1665,25.4,765,11.7,62000,0.48,9.7,Barking and Dagenham,1627,522,404
1,2015,Barnet,E09000003,26190,4460,17.0,3410,13.0,168000,0.68,5.8,Barnet,5011,1488,1284
2,2015,Bexley,E09000004,9075,1605,17.7,945,10.4,86000,0.57,6.0,Bexley,4197,832,586
3,2015,Brent,E09000005,15745,2895,18.4,1800,11.4,136000,0.62,7.1,Brent,5702,1841,1394
4,2015,Bromley,E09000006,15695,2340,14.9,1620,10.3,124000,0.61,4.9,Bromley,4947,1673,532

In [93]:
df2015_joined.drop('Borough', axis=1, inplace=True)

df2015_joined.head()

,year,area,code,active_enterprises,births,birth_rate,deaths,death_rate,number_of_jobs,job_density,unemployment_rate,vacancies,hard-to-fill_vacancies,skills-shortage_vacancies
0,2015,Barking and Dagenham,E09000002,6560,1665,25.4,765,11.7,62000,0.48,9.7,1627,522,404
1,2015,Barnet,E09000003,26190,4460,17.0,3410,13.0,168000,0.68,5.8,5011,1488,1284
2,2015,Bexley,E09000004,9075,1605,17.7,945,10.4,86000,0.57,6.0,4197,832,586
3,2015,Brent,E09000005,15745,2895,18.4,1800,11.4,136000,0.62,7.1,5702,1841,1394
4,2015,Bromley,E09000006,15695,2340,14.9,1620,10.3,124000,0.61,4.9,4947,1673,532

In [96]:
df2015_joined

,year,area,code,active_enterprises,births,birth_rate,deaths,death_rate,number_of_jobs,job_density,unemployment_rate,vacancies,hard-to-fill_vacancies,skills-shortage_vacancies
0,2015,Barking and Dagenham,E09000002,6560,1665,25.4,765,11.7,62000,0.48,9.7,1627,522,404
1,2015,Barnet,E09000003,26190,4460,17.0,3410,13.0,168000,0.68,5.8,5011,1488,1284
2,2015,Bexley,E09000004,9075,1605,17.7,945,10.4,86000,0.57,6.0,4197,832,586
3,2015,Brent,E09000005,15745,2895,18.4,1800,11.4,136000,0.62,7.1,5702,1841,1394
4,2015,Bromley,E09000006,15695,2340,14.9,1620,10.3,124000,0.61,4.9,4947,1673,532
5,2015,Camden,E09000007,31385,5445,17.3,3415,10.9,383000,2.21,5.5,12346,2162,1883
6,2015,Croydon,E09000008,15540,2695,17.3,1785,11.5,144000,0.58,5.3,4444,1683,1043
7,2015,Ealing,E09000009,18700,3420,18.3,2065,11.0,163000,0.71,6.1,7009,1768,1462
8,2015,Enfield,E09000010,13925,2520,18.1,1740,12.5,133000,0.63,5.9,3668,1658,880
9,2015,Greenwich,E09000011,10060,2260,22.5,1200,11.9,96000,0.51,6.8,2155,710,540
10,2015,Hackney,E09000012,18510,4105,22.2,2025,10.9,136000,0.70,6.7,2844,589,523
11,2015,Hammersmith and Fulham,E09000013,14095,2560,18.2,1740,12.3,154000,1.16,6.1,5802,1207,824
12,2015,Haringey,E09000014,12675,2350,18.5,1425,11.2,93000,0.49,6.7,2171,303,265
13,2015,Harrow,E09000015,15155,2605,17.2,1805,11.9,88000,0.55,4.5,1920,427,288
14,2015,Havering,E09000016,10115,1720,17.0,1085,10.7,93000,0.60,6.0,2621,637,474
15,2015,Hillingdon,E09000017,13505,2310,17.1,1450,10.7,202000,1.04,5.8,8359,1715,1323
16,2015,Hounslow,E09000018,13910,2525,18.2,1565,11.3,187000,1.04,5.1,6429,1389,1003
17,2015,Islington,E09000019,22110,5470,24.7,4090,18.5,250000,1.46,6.4,17906,6009,5919
18,2015,Kensington and Chelsea,E09000020,14350,2355,16.4,1455,10.1,150000,1.36,5.1,5062,928,766
19,2015,Kingston upon Thames,E09000021,8970,1370,15.3,890,9.9,95000,0.82,4.9,2033,727,304
20,2015,Lambeth,E09000022,17280,3425,19.8,2620,15.2,185000,0.77,6.1,4974,1615,1242
21,2015,Lewisham,E09000023,10405,2045,19.7,1290,12.4,83000,0.40,6.2,2142,786,716
22,2015,Merton,E09000024,12070,2225,18.4,1300,10.8,98000,0.70,4.7,3058,751,480
23,2015,Newham,E09000025,11055,2860,25.9,1450,13.1,114000,0.48,7.5,3185,598,382
24,2015,Redbridge,E09000026,14595,3150,21.6,1960,13.4,92000,0.47,5.9,3495,1309,1065
25,2015,Richmond upon Thames,E09000027,14185,2025,14.3,1370,9.7,102000,0.82,4.3,2998,802,432
26,2015,Southwark,E09000028,17120,3135,18.3,1970,11.5,289000,1.28,6.7,8014,1834,1766
27,2015,Sutton,E09000029,8710,1345,15.4,990,11.4,80000,0.62,5.3,2790,705,503
28,2015,Tower Hamlets,E09000030,18390,3920,21.3,2450,13.3,298000,1.37,7.6,11369,3315,3133
29,2015,Waltham Forest,E09000031,11020,2490,22.6,1320,12.0,86000,0.47,6.5,2216,1052,827
30,2015,Wandsworth,E09000032,18695,3600,19.3,2180,11.7,144000,0.61,5.0,4569,1288,998
31,2015,Westminster,E09000033,55385,9060,16.4,6305,11.4,756000,4.42,6.3,24765,6108,5487
32,2015,North East,E12000001,71010,9635,13.6,7710,10.9,1196000,0.72,7.7,NaN,NaN,NaN
33,2015,North West,E12000002,259740,36495,14.1,29380,11.3,3603000,0.80,5.3,NaN,NaN,NaN
34,2015,East Midlands,E12000004,176220,25345,14.4,18280,10.4,2304000,0.78,4.7,NaN,NaN,NaN
35,2015,West Midlands,E12000005,207980,29350,14.1,21450,10.3,2818000,0.79,5.8,NaN,NaN,NaN
36,2015,East,E12000006,265375,35440,13.4,26790,10.1,3053000,0.81,3.9,NaN,NaN,NaN
37,2015,London,E12000007,541310,100920,18.6,63750,11.8,5810000,0.98,6.1,NaN,NaN,NaN
38,2015,South East,E12000008,420270,55590,13.2,42065,10.0,4836000,0.87,4.2,NaN,NaN,NaN
39,2015,South West,E12000009,222015,26150,11.8,21555,9.7,2904000,0.87,3.9,NaN,NaN,NaN
40,2015,England,E92000001,2347740,344065,14.7,249995,10.6,29219000,0.84,5.1,NaN,NaN,NaN
41,2015,Wales,W92000004,95010,11525,12.1,9620,10.1,1433000,0.75,5.9,NaN,NaN,NaN
42,2015,Scotland,S92000003,172890,21725,12.6,18260,10.6,2758000,0.79,5.8,NaN,NaN,NaN
43,2015,Great Britain,K03000001,2615640,377315,14.4,277875,10.6,33409000,0.83,5.2,NaN,NaN,NaN

In [95]:
PROC_DATA_PATH = '~/library/data/processed/'
df2015_joined.to_csv(PROC_DATA_PATH + 'unemployment_vacancies2015.csv')